Revit 2027 API
BuildingEnvelopeAnalyzer.GetBoundingElementsForSpaceVolume Method
 Returns the collection of bounding building elements for an enclosed space volume.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<LinkElementId> GetBoundingElementsForSpaceVolume(
	int spaceVolume
)
Public Function GetBoundingElementsForSpaceVolume (
	spaceVolume As Integer
) As IList(Of LinkElementId)
public:
IList<LinkElementId^>^ GetBoundingElementsForSpaceVolume(
	int spaceVolume
)
member GetBoundingElementsForSpaceVolume :
        spaceVolume : int -> IList<LinkElementId>
Parameters
spaceVolume Int32
Return Value
IList<LinkElementId>
 The ids of the bounding building elements for the enclosed space volume.
Remarks
 This method requires the building envelope analyzer method created with the option set to compute enclosed space volumes.
See Also
Reference
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace